In [1]:
import numpy as np
import pandas as pd

## DataFrame

In [14]:
## transforms data into an excel spreadsheet style structure

In [16]:
data=np.random.randn(4,3)

In [18]:
data

array([[-1.13439803, -0.47801239,  0.79266339],
       [-0.61150752, -1.21697035, -0.05705954],
       [ 0.22395348, -0.03619035, -0.56777756],
       [ 1.26221588,  0.869494  ,  0.38193154]])

In [20]:
dataFrame=pd.DataFrame(data)

In [26]:
dataFrame

          0         1         2
0 -1.134398 -0.478012  0.792663
1 -0.611508 -1.216970 -0.057060
2  0.223953 -0.036190 -0.567778
3  1.262216  0.869494  0.381932

In [28]:
dataFrame[0]

0   -1.134398
1   -0.611508
2    0.223953
3    1.262216
Name: 0, dtype: float64

In [34]:
type(dataFrame)

pandas.core.frame.DataFrame

In [36]:
type(dataFrame[0])

pandas.core.series.Series

In [42]:
newDataFrame=pd.DataFrame(data,index=["Ellie","Nick","Jonas","Sana"],columns=["Salary","Age","Working Hours"])

In [44]:
newDataFrame

         Salary       Age  Working Hours
Ellie -1.134398 -0.478012       0.792663
Nick  -0.611508 -1.216970      -0.057060
Jonas  0.223953 -0.036190      -0.567778
Sana   1.262216  0.869494       0.381932

In [46]:
newDataFrame["Age"]

Ellie   -0.478012
Nick    -1.216970
Jonas   -0.036190
Sana     0.869494
Name: Age, dtype: float64

In [48]:
newDataFrame["Working Hours"]

Ellie    0.792663
Nick    -0.057060
Jonas   -0.567778
Sana     0.381932
Name: Working Hours, dtype: float64

In [52]:
newDataFrame[["Salary","Age"]] ## Columns

         Salary       Age
Ellie -1.134398 -0.478012
Nick  -0.611508 -1.216970
Jonas  0.223953 -0.036190
Sana   1.262216  0.869494

In [54]:
newDataFrame.loc["Ellie"] # row

Salary          -1.134398
Age             -0.478012
Working Hours    0.792663
Name: Ellie, dtype: float64

In [60]:
newDataFrame.iloc[3] #index Location

Salary           1.262216
Age              0.869494
Working Hours    0.381932
Name: Sana, dtype: float64

In [62]:
newDataFrame

         Salary       Age  Working Hours
Ellie -1.134398 -0.478012       0.792663
Nick  -0.611508 -1.216970      -0.057060
Jonas  0.223953 -0.036190      -0.567778
Sana   1.262216  0.869494       0.381932

In [124]:
newDataFrame["Retirement Age"]=newDataFrame["Age"]*2

In [126]:
newDataFrame

         Salary       Age  Working Hours  Retirement Age
Ellie -1.134398 -0.478012       0.792663       -0.956025
Nick  -0.611508 -1.216970      -0.057060       -2.433941
Jonas  0.223953 -0.036190      -0.567778       -0.072381
Sana   1.262216  0.869494       0.381932        1.738988

In [128]:
newDataFrame.drop("Sana",axis=0) # 1 - columns, 0 - row

         Salary       Age  Working Hours  Retirement Age
Ellie -1.134398 -0.478012       0.792663       -0.956025
Nick  -0.611508 -1.216970      -0.057060       -2.433941
Jonas  0.223953 -0.036190      -0.567778       -0.072381

In [130]:
newDataFrame.drop("Retirement Age",axis=1,inplace=True)

In [132]:
newDataFrame

         Salary       Age  Working Hours
Ellie -1.134398 -0.478012       0.792663
Nick  -0.611508 -1.216970      -0.057060
Jonas  0.223953 -0.036190      -0.567778
Sana   1.262216  0.869494       0.381932

In [134]:
newDataFrame.loc["Jonas"]

Salary           0.223953
Age             -0.036190
Working Hours   -0.567778
Name: Jonas, dtype: float64

In [136]:
newDataFrame.loc["Jonas"]["Age"]

-0.03619034923561611

In [138]:
newDataFrame.loc["Ellie","Age"]

-0.47801239120084815

In [140]:
newDataFrame

         Salary       Age  Working Hours
Ellie -1.134398 -0.478012       0.792663
Nick  -0.611508 -1.216970      -0.057060
Jonas  0.223953 -0.036190      -0.567778
Sana   1.262216  0.869494       0.381932

In [142]:
newDataFrame[newDataFrame<0]

         Salary       Age  Working Hours
Ellie -1.134398 -0.478012            NaN
Nick  -0.611508 -1.216970      -0.057060
Jonas       NaN -0.036190      -0.567778
Sana        NaN       NaN            NaN

In [144]:
booleanFrame=newDataFrame<0

In [146]:
booleanFrame

       Salary    Age  Working Hours
Ellie    True   True          False
Nick     True   True           True
Jonas   False   True           True
Sana    False  False          False

In [148]:
newDataFrame[booleanFrame]

         Salary       Age  Working Hours
Ellie -1.134398 -0.478012            NaN
Nick  -0.611508 -1.216970      -0.057060
Jonas       NaN -0.036190      -0.567778
Sana        NaN       NaN            NaN

In [150]:
newDataFrame[newDataFrame["Age"]<0]

         Salary       Age  Working Hours
Ellie -1.134398 -0.478012       0.792663
Nick  -0.611508 -1.216970      -0.057060
Jonas  0.223953 -0.036190      -0.567778

In [153]:
newDataFrame.reset_index()

   index    Salary       Age  Working Hours
0  Ellie -1.134398 -0.478012       0.792663
1   Nick -0.611508 -1.216970      -0.057060
2  Jonas  0.223953 -0.036190      -0.567778
3   Sana  1.262216  0.869494       0.381932

In [155]:
newDataFrame

         Salary       Age  Working Hours
Ellie -1.134398 -0.478012       0.792663
Nick  -0.611508 -1.216970      -0.057060
Jonas  0.223953 -0.036190      -0.567778
Sana   1.262216  0.869494       0.381932

In [157]:
newIndexList=["E","N","J","S"]

In [159]:
newDataFrame["New Index"]=newIndexList

In [161]:
newDataFrame

         Salary       Age  Working Hours New Index
Ellie -1.134398 -0.478012       0.792663         E
Nick  -0.611508 -1.216970      -0.057060         N
Jonas  0.223953 -0.036190      -0.567778         J
Sana   1.262216  0.869494       0.381932         S

In [163]:
newDataFrame.set_index("New Index")

             Salary       Age  Working Hours
New Index
E         -1.134398 -0.478012       0.792663
N         -0.611508 -1.216970      -0.057060
J          0.223953 -0.036190      -0.567778
S          1.262216  0.869494       0.381932

In [165]:
newDataFrame

         Salary       Age  Working Hours New Index
Ellie -1.134398 -0.478012       0.792663         E
Nick  -0.611508 -1.216970      -0.057060         N
Jonas  0.223953 -0.036190      -0.567778         J
Sana   1.262216  0.869494       0.381932         S

In [167]:
newDataFrame.set_index("New Index",inplace=True)

In [169]:
newDataFrame

             Salary       Age  Working Hours
New Index
E         -1.134398 -0.478012       0.792663
N         -0.611508 -1.216970      -0.057060
J          0.223953 -0.036190      -0.567778
S          1.262216  0.869494       0.381932

In [173]:
newDataFrame.loc["J"]

Salary           0.223953
Age             -0.036190
Working Hours   -0.567778
Name: J, dtype: float64

In [199]:
firstIndex=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [201]:
secondIndex=["Homer","Bart","Marge","Cartman","Kenny","Kyle","Kendall"]

In [203]:
mixedIndex=list(zip(firstIndex,secondIndex))

In [205]:
mixedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [207]:
mixedIndex=pd.MultiIndex.from_tuples(mixedIndex)

In [209]:
mixedIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [211]:
type(mixedIndex)

pandas.core.indexes.multi.MultiIndex

In [213]:
myCartoonList=[[23,"A"],[12,"B"],[56,"C"],[87,"D"],[94,"E"],[252,"F"]]

In [215]:
cartoonList=np.array(myCartoonList)

In [217]:
cartoonList

array([['23', 'A'],
       ['12', 'B'],
       ['56', 'C'],
       ['87', 'D'],
       ['94', 'E'],
       ['252', 'F']], dtype='<U11')

In [219]:
cartoonDataFrame=pd.DataFrame(cartoonList,index=mixedIndex,columns=["Age","Occupation"])

In [222]:
cartoonDataFrame

                    Age Occupation
Simpson    Homer     23          A
           Bart      12          B
           Marge     56          C
South Park Cartman   87          D
           Kenny     94          E
           Kyle     252          F

In [224]:
cartoonDataFrame.loc["Simpson"]

      Age Occupation
Homer  23          A
Bart   12          B
Marge  56          C

In [226]:
cartoonDataFrame.loc["South Park"]

         Age Occupation
Cartman   87          D
Kenny     94          E
Kyle     252          F

In [228]:
cartoonDataFrame.loc["South Park"].loc["Kyle"]

Age           252
Occupation      F
Name: Kyle, dtype: object

In [230]:
cartoonDataFrame.index.names=["Cartoon Name","Char"]

In [232]:
cartoonDataFrame

                      Age Occupation
Cartoon Name Char
Simpson      Homer     23          A
             Bart      12          B
             Marge     56          C
South Park   Cartman   87          D
             Kenny     94          E
             Kyle     252          F